app/views/posts/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]
---
      <h3 class="card-title txt-title"> Posted Comments</h3><p></p>
      <% if @post.comments.all.count <= 0 %>