app/controllers/change_role_controller.rb

SELECT "users".* FROM "users" WHERE "users"."is_requested" = ?  [["is_requested", 1]]
---
  def role_change_requests
    @users = User.where(is_requested: true)

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "is_requested" = ? WHERE "users"."id" = ?  [["is_requested", 1], ["id", 3]]
---
  def disapprove_request
    @user = User.find(params[:_id])
    @user.update_column(:is_requested, false)

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "is_requested" = ? WHERE "users"."id" = ?  [["is_requested", 1], ["id", 1]]
---
  def requested_admin_role
    @user = User.find(current_user.id)
    if @user.is_admin?
      redirect_to your_posts_get_posts_path, notice: "You are already an Admin!"
    elsif @user.is_requested?
      redirect_to your_posts_get_posts_path, notice: "You have already placed a request!"
    else
      @user.update_column(:is_requested, true)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "is_admin" = ? WHERE "users"."id" = ?  [["is_admin", 1], ["id", 1]]
UPDATE "users" SET "is_requested" = ? WHERE "users"."id" = ?  [["is_requested", 0], ["id", 1]]
---
  def update_is_admin
    @user = User.find(params[:_id])
    if @user.is_admin?
      redirect_to change_role_role_change_requests_path, notice: "Already an Admin!"
    elsif @user.is_requested?
      @user.update_column(:is_admin, true)
      @user.update_column(:is_requested, false)