app/controllers/handle_posts_controller.rb

  def posts_tobe_approved
    @posts = Post.where(is_approved: false)
---
SELECT "posts".* FROM "posts" WHERE "posts"."is_approved" = ?  [["is_approved", 0]]

  def pending_posts
    @your_pending_posts = Post.where(user_id: current_user.id, is_approved: false)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."is_approved" = ?  [["user_id", 3], ["is_approved", 0]]