app/controllers/posts_controller.rb

UPDATE "posts" SET "is_approved" = ? WHERE "posts"."id" = ?  [["is_approved", 1], ["id", 4]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def delete_image
    @image = ActiveStorage::Blob.find_signed(params[:id]).purge
    @post = Post.find(params[:post_id])