app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."is_approved" = ?  [["is_approved", 1]]
---
  def index
    @posts = Post.where(is_approved: true)

INSERT INTO "posts" ("title", "body", "author", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["body", ""], ["author", ""], ["user_id", 3], ["created_at", "2022-05-20 11:00:01.436830"], ["updated_at", "2022-05-20 11:00:01.436830"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE (2) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @posts = Post.all
    @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def delete_image
    @image = ActiveStorage::Blob.find_signed(params[:id]).purge
    @post = Post.find(params[:post_id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "posts" SET "is_approved" = ? WHERE "posts"."id" = ?  [["is_approved", 1], ["id", 6]]
---
  def approve_post
    @posts = Post.where(is_approved: false)
    @post = Post.find(params[:id])
    @post.update_column(:is_approved, true)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def correct_user
    @post = current_user.posts.find_by(id: params["id"])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def correct_user_or_admin
    @post = Post.find_by(id: params["id"])