app/controllers/your_posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
---
  def get_posts
    @posts = Post.where(user_id: current_user.id, is_approved: true)