app/controllers/users/registrations_controller.rb

  def create
    if resource_params[:password] == resource_params[:password_confirmation]
      @user = User.find_by(email: resource_params[:email])
      if @user.nil?
        @user0 = User.find_by(username: resource_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "dhh53452634@mail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "RSalehin24"], ["LIMIT", 1]]

  def update
    if resource_params[:password] == resource_params[:password_confirmation]
      user = User.find_for_authentication(email: resource_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "reyanussalehin@iut-dhaka.ed"], ["LIMIT", 1]]