app/controllers/users/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "something@mail.com"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(email: resource_params[:email])